MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC123SD4AN0/mcu.h
/**
 * @var PDMA_GCR_T::GCRCSR
 * Offset: 0x00  PDMA Global Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[8]     |CLK0_EN   |PDMA Controller Channel 0 Clock Enable Control
 * |        |          |0 = CRC controller clock Disabled.
 * |        |          |1 = CRC controller clock Enabled.
 * |[9]     |CLK1_EN   |PDMA Controller Channel 1 Clock Enable Control
 * |        |          |0 = PDMA channel 1 clock Disabled.
 * |        |          |1 = PDMA channel 1 clock Enabled.
 * |[10]    |CLK2_EN   |PDMA Controller Channel 2 Clock Enable Control
 * |        |          |0 = PDMA channel 2 clock Disabled.
 * |        |          |1 = PDMA channel 2 clock Enabled.
 * |[11]    |CLK3_EN   |PDMA Controller Channel 3 Clock Enable Control
 * |        |          |0 = PDMA channel 3 clock Disabled.
 * |        |          |1 = PDMA channel 3 clock Enabled.
 * |[12]    |CLK4_EN   |PDMA Controller Channel 4 Clock Enable Control
 * |        |          |0 = PDMA channel 4 clock Disabled.
 * |        |          |1 = PDMA channel 4 clock Enabled.
 * |[13]    |CLK5_EN   |PDMA Controller Channel 5 Clock Enable Control
 * |        |          |0 = PDMA channel 5 clock Disabled.
 * |        |          |1 = PDMA channel 5 clock Enabled.
 * |[24]    |CRC_CLK_EN|CRC Controller Clock Enable Control
 * |        |          |0 = CRC controller clock Disabled.
 * |        |          |1 = CRC controller clock Enabled.
 * @var PDMA_GCR_T::PDSSR0
 * Offset: 0x04  PDMA Service Selection Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |SPI0_RXSEL|PDMA SPI0 RX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral SPI0 RX.
 * |        |          |Software can change the channel RX setting by SPI0_RXSEL.
 * |        |          |0000: CH0
 * |        |          |0001: CH1
 * |        |          |0010: CH2
 * |        |          |0011: CH3
 * |        |          |0100: CH4
 * |        |          |0101: CH5
 * |        |          |Others : Reserved
 * |        |          |Note: For example, SPI0_RXSEL = 0100, that means SPI0_RX is connected to PDMA_CH4.
 * |[7:4]   |SPI0_TXSEL|PDMA SPI0 TX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral SPI0 TX.
 * |        |          |Software can configure the TX channel setting by SPI0_TXSEL.
 * |        |          |The channel configuration is the same as SPI0_RXSEL field.
 * |        |          |Please refer to the explanation of SPI0_RXSEL.
 * |[11:8]  |SPI1_RXSEL|PDMA SPI1 RX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral SPI1 RX.
 * |        |          |Software can configure the RX channel setting by SPI1_RXSEL.
 * |        |          |The channel configuration is the same as SPI0_RXSEL field.
 * |        |          |Please refer to the explanation of SPI0_RXSEL.
 * |[15:12] |SPI1_TXSEL|PDMA SPI1 TX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral SPI1 TX.
 * |        |          |Software can configure the TX channel setting by SPI1_TXSEL.
 * |        |          |The channel configuration is the same as SPI0_RXSEL field.
 * |        |          |Please refer to the explanation of SPI0_RXSEL.
 * |[19:16] |SPI2_RXSEL|PDMA SPI2 RX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral SPI2 RX.
 * |        |          |Software can configure the RX channel setting by SPI2_RXSEL.
 * |        |          |The channel configuration is the same as SPI0_RXSEL field.
 * |        |          |Please refer to the explanation of SPI0_RXSEL.
 * |[23:20] |SPI2_TXSEL|PDMA SPI2 TX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral SPI2 TX.
 * |        |          |Software can configure the TX channel setting by SPI2_TXSEL.
 * |        |          |The channel configuration is the same as SPI0_RXSEL field.
 * |        |          |Please refer to the explanation of SPI0_RXSEL.
 * @var PDMA_GCR_T::PDSSR1
 * Offset: 0x08  PDMA Service Selection Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |UART0_RXSEL|PDMA UART0 RX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral UART0 RX.
 * |        |          |Software can change the channel RX setting by UART0_RXSEL.
 * |        |          |0000: CH0
 * |        |          |0001: CH1
 * |        |          |0010: CH2
 * |        |          |0011: CH3
 * |        |          |0100: CH4
 * |        |          |0101: CH5
 * |        |          |Others : Reserved
 * |        |          |Note: For example, UART0_RXSEL = 0100, which means UART0_RX is connected to PDMA_CH4.
 * |[7:4]   |UART0_TXSEL|PDMA UART0 TX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral UART0 TX.
 * |        |          |Software can configure the TX channel setting by UART0_TXSEL.
 * |        |          |The channel configuration is the same as UART0_RXSEL field.
 * |        |          |Please refer to the explanation of UART0_RXSEL.
 * |[11:8]  |UART1_RXSEL|PDMA UART1 RX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral UART1 RX.
 * |        |          |Software can configure the RX channel setting by UART1_RXSEL.
 * |        |          |The channel configuration is the same as UART0_RXSEL field.
 * |        |          |Please refer to the explanation of UART0_RXSEL.
 * |[15:12] |UART1_TXSEL|PDMA UART1 TX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral UART1 TX.
 * |        |          |Software can configure the TX channel setting by UART1_TXSEL.
 * |        |          |The channel configuration is the same as UART0_RXSEL field.
 * |        |          |Please refer to the explanation of UART0_RXSEL.
 * |[27:24] |ADC_RXSEL |PDMA ADC RX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral ADC RX.
 * |        |          |Software can configure the RX channel setting by ADC_RXSEL.
 * |        |          |The channel configuration is the same as UART0_RXSEL field.
 * |        |          |Please refer to the explanation of UART0_RXSEL.
 * @var PDMA_GCR_T::GCRISR
 * Offset: 0x0C  PDMA Global Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |INTR0     |Interrupt Status Of Channel 0
 * |        |          |This bit is the interrupt status of PDMA channel 0.
 * |        |          |Note: This bit is read only
 * |[1]     |INTR1     |Interrupt Status Of Channel 1
 * |        |          |This bit is the interrupt status of PDMA channel 1.
 * |        |          |Note: This bit is read only
 * |[2]     |INTR2     |Interrupt Status Of Channel 2
 * |        |          |This bit is the interrupt status of PDMA channel 2.
 * |        |          |Note: This bit is read only
 * |[3]     |INTR3     |Interrupt Status Of Channel 3
 * |        |          |This bit is the interrupt status of PDMA channel 3.
 * |        |          |Note: This bit is read only
 * |[4]     |INTR4     |Interrupt Status Of Channel 4
 * |        |          |This bit is the interrupt status of PDMA channel 4.
 * |        |          |Note: This bit is read only
 * |[5]     |INTR5     |Interrupt Status Of Channel 5
 * |        |          |This bit is the interrupt status of PDMA channel 5.
 * |        |          |Note: This bit is read only
 * |[16]    |INTRCRC   |Interrupt Status Of CRC Controller
 * |        |          |This bit is the interrupt status of CRC controller
 * |        |          |Note: This bit is read only
 * |[31]    |INTR      |Interrupt Status
 * |        |          |This bit is the interrupt status of PDMA controller.
 * |        |          |Note: This bit is read only
 * @var PDMA_GCR_T::PDSSR2
 * Offset: 0x10  PDMA Service Selection Control Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |I2S_RXSEL |PDMA I2S RX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral I2S RX.
 * |        |          |Software can change the channel RX setting by I2S_RXSEL.
 * |        |          |0000: CH0
 * |        |          |0001: CH1
 * |        |          |0010: CH2
 * |        |          |0011: CH3
 * |        |          |0100: CH4
 * |        |          |0101: CH5
 * |        |          |Others : Reserved
 * |        |          |Note: For example: I2S_RXSEL (PDMA_PDSSR2[3:0]) = 0100, that means I2S_RX is connected to PDMA_CH4.
 * |[7:4]   |I2S_TXSEL |PDMA I2S TX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral I2S TX.
 * |        |          |Software can configure the TX channel setting by I2S_TXSEL.
 * |        |          |The channel configuration is the same as I2S_RXSEL field.
 * |        |          |Please refer to the explanation of I2S_RXSEL.
 * |[11:8]  |PWM0_RXSEL|PDMA PWM0 RX Selection
 * |        |          |This filed defines which PDMA channel is connected to the on-chip peripheral PWM0 RX.
 * |        |          |Software can configure the RX channel setting by PWM0_RXSEL.
 * |        |          |The channel configuration is the same as I2S_RXSEL field.
 * |        |          |Please refer to the explanation of I2S_RXSEL.
 * |[15:12] |PWM1_RXSEL|PDMA PWM1 RX Selection
 * |        |          |This filed defines which PDMA channel is connected to the on-chip peripheral PWM1 RX.
 * |        |          |Software can configure the RX channel setting by PWM1_RXSEL.
 * |        |          |The channel configuration is the same as I2S_RXSEL field.
 * |        |          |Please refer to the explanation of I2S_RXSEL.
 * |[19:16] |PWM2_RXSEL|PDMA PWM2 RX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral PWM2 RX.
 * |        |          |Software can configure the RX channel setting by PWM2_RXSEL.
 * |        |          |The channel configuration is the same as I2S_RXSEL field.
 * |        |          |Please refer to the explanation of I2S_RXSEL.
 * |[23:20] |PWM3_RXSEL|PDMA PWM3 RX Selection
 * |        |          |This field defines which PDMA channel is connected to the on-chip peripheral PWM3 RX.
 * |        |          |Software can configure the RX channel setting by PWM3_RXSEL.
 * |        |          |The channel configuration is the same as I2S_RXSEL field.
 * |        |          |Please refer to the explanation of I2S_RXSEL.
 */

    __IO uint32_t GCRCSR;        /* Offset: 0x00  PDMA Global Control Register                                       */
    __IO uint32_t PDSSR0;        /* Offset: 0x04  PDMA Service Selection Control Register 0                          */
    __IO uint32_t PDSSR1;        /* Offset: 0x08  PDMA Service Selection Control Register 1                          */
    __IO uint32_t GCRISR;        /* Offset: 0x0C  PDMA Global Interrupt Status Register                              */
    __IO uint32_t PDSSR2;        /* Offset: 0x10  PDMA Service Selection Control Register 2                          */

} PDMA_GCR_T;




/** @addtogroup REG_PDMA_BITMASK PDMA Bit Mask
  @{
 */

/* PDMA CSR Bit Field Definitions */
#define PDMA_CSR_TRIG_EN_Pos                        23                              /*!< PDMA_T::CSR: TRIG_EN Position */
#define PDMA_CSR_TRIG_EN_Msk                        (1ul << PDMA_CSR_TRIG_EN_Pos)   /*!< PDMA_T::CSR: TRIG_EN Mask */

#define PDMA_CSR_APB_TWS_Pos                        19                              /*!< PDMA_T::CSR: APB_TWS Position */
#define PDMA_CSR_APB_TWS_Msk                        (3ul << PDMA_CSR_APB_TWS_Pos)   /*!< PDMA_T::CSR: APB_TWS Mask */

