MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC123SD4AN0/mcu.h
 * |        |          |switching PWM1 operation mode (PCR[11]) to make sure previous setting has been updated completely.
 * |        |          |This bit will be set when software writes CNR1/CMR1/PPR or switches PWM1 operation mode (PCR[11])
 * |        |          |and will be cleared by hardware automatically when PWM update these value completely.
 * @var PWM_T::SYNCBUSY2
 * Offset: 0x90  PWM2 Synchronous Busy Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |S_BUSY    |PWM Synchronous Busy
 * |        |          |When Software writes CNR2/CMR2/PPR or switch PWM2 operation mode (PCR[19]),
 * |        |          |PWM will have a busy time to update these values completely because
 * |        |          |PWM clock may be different from system clock domain.
 * |        |          |Software needs to check this busy status before writing CNR2/CMR2/PPR or
 * |        |          |switching PWM2 operation mode (PCR[19]) to make sure previous setting has been updated completely.
 * |        |          |This bit will be set when software writes CNR2/CMR2/PPR or switch PWM2 operation mode (PCR[19])
 * |        |          |and will be cleared by hardware automatically when PWM update these value completely.
 * @var PWM_T::SYNCBUSY3
 * Offset: 0x94  PWM3 Synchronous Busy Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |S_BUSY    |PWM Synchronous Busy
 * |        |          |When Software writes CNR3/CMR3/PPR or switch PWM3 operation mode (PCR[27]),
 * |        |          |PWM will have a busy time to update these values completely because
 * |        |          |PWM clock may be different from system clock domain.
 * |        |          |Software need to check this busy status before writing CNR3/CMR3/PPR or
 * |        |          |switching PWM3 operation mode (PCR[27]) to make sure previous setting has been updated completely.
 * |        |          |This bit will be set when Software writes CNR3/CMR3/PPR or switch PWM3 operation mode (PCR[27])
 * |        |          |and will be cleared by hardware automatically when PWM update these value completely.
 * @var PWM_T::CAPPDMACTL
 * Offset: 0xC0  PWM Group A Trigger Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field       |Descriptions
 * | :----: | :----:     | :---- |
 * |[0]     |CAP0PDMAEN  |Channel 0 PDMA Enable Bit
 * |        |            |0 = Channel 0 PDMA function Disabled.
 * |        |            |1 = Channel 0 PDMA function Enabled for the channel 0 captured data and transfer to memory.
 * |[2:1]   |CAP0PDMAMOD |Select CRLR0 or CFLR0 to Transfer PDMA
 * |        |            |00 = Reserved
 * |        |            |01 = CRLR0
 * |        |            |10 = CFLR0
 * |        |            |11 = Both CRLR0 and CFLR0
 * |[3]     |CAP0RFORDER |Capture channel 0 Rising/Falling Order
 * |        |            |Set this bit to determine whether the CRLR0 or CFLR0 is the first captured data transferred to memory through PDMA when CAP0PDMAMOD =11
 * |        |            |0 = CFLR0 is the first captured data to memory.
 * |        |            |1 = CRLR0 is the first captured data to memory.
 * |[8]     |CAP1PDMAEN  |Channel 1 PDMA Enable Bit
 * |        |            |0 = Channel 1 PDMA function Disabled.
 * |        |            |1 = Channel 1 PDMA function Enabled for the channel 1 captured data and transfer to memory.
 * |[10:9]  |CAP1PDMAMOD |Select CRLR1 or CFLR1 to Transfer PDMA
 * |        |            |00 = Reserved
 * |        |            |01 = CRLR1
 * |        |            |10 = CFLR1
 * |        |            |11 = Both CRLR1 and CFLR1
 * |[11]    |CAP1RFORDER |Capture channel 1 Rising/Falling Order
 * |        |            |Set this bit to determine whether the CRLR1 or CFLR1 is the first captured data transferred to memory through PDMA when CAP1PDMAMOD =11
 * |        |            |0 = CFLR1 is the first captured data to memory.
 * |        |            |1 = CRLR1 is the first captured data to memory.
 * |[16]    |CAP2PDMAEN  |Channel 2 PDMA Enable Bit
 * |        |            |0 = Channel 2 PDMA function Disabled.
 * |        |            |1 = Channel 2 PDMA function Enabled for the channel 2 captured data and transfer to memory.
 * |[18:17] |CAP2PDMAMOD |Select CRLR2 or CFLR2 to Transfer PDMA
 * |        |            |00 = Reserved
 * |        |            |01 = CRLR2
 * |        |            |10 = CFLR2
 * |        |            |11 = Both CRLR2 and CFLR2
 * |[19]    |CAP2RFORDER |Capture channel 2 Rising/Falling Order
 * |        |            |Set this bit to determine whether the CRLR2 or CFLR2 is the first captured data transferred to memory through PDMA when CAP2PDMAMOD =11
 * |        |            |0 = CFLR2 is the first captured data to memory.
 * |        |            |1 = CRLR2 is the first captured data to memory.
 * |[24]    |CAP3PDMAEN  |Channel 3 PDMA Enable Bit
 * |        |            |0 = Channel 3 PDMA function Disabled.
 * |        |            |1 = Channel 3 PDMA function Enabled for the channel 3 captured data and transfer to memory.
 * |[26:25] |CAP3PDMAMOD |Select CRLR3 or CFLR3 to Transfer PDMA
 * |        |            |00 = Reserved
 * |        |            |01 = CRLR3
 * |        |            |10 = CFLR3
 * |        |            |11 = Both CRLR3 and CFLR3
 * |[27]    |CAP3RFORDER |Capture channel 3 Rising/Falling Order
 * |        |            |Set this bit to determine whether the CRLR1 or CFLR3 is the first captured data transferred to memory through PDMA when CAP3PDMAMOD =11
 * |        |            |0 = CFLR3 is the first captured data to memory.
 * |        |            |1 = CRLR3 is the first captured data to memory.
 * @var PWM_T::CAP0PDMA
 * Offset: 0xC4  PWM Group A PDMA channel 0 DATA Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CAP0RFPDMA|PDMA data register for channel 0
 * |        |          |it is the capturing value(CFLR0/CRLR0) for channel 0.
 * @var PWM_T::CAP1PDMA
 * Offset: 0xC8  PWM Group A PDMA channel 1 DATA Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CAP1RFPDMA|PDMA data register for channel 1
 * |        |          |it is the capturing value(CFLR1/CRLR1) for channel 1.
 * @var PWM_T::CAP2PDMA
 * Offset: 0xCC  PWM Group A PDMA channel 2 DATA Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CAP2RFPDMA|PDMA data register for channel 2
 * |        |          |it is the capturing value(CFLR2/CRLR2) for channel 2.
 * @var PWM_T::CAP3PDMA
 * Offset: 0xD0  PWM Group A PDMA channel 3 DATA Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CAP3RFPDMA|PDMA data register for channel 3
 * |        |          |it is the capturing value(CFLR3/CRLR3) for channel 3.
 */

    __IO uint32_t PPR;           /* Offset: 0x00  PWM Prescaler Register                                             */
    __IO uint32_t CSR;           /* Offset: 0x04  PWM Clock Source Divider Select Register                           */
    __IO uint32_t PCR;           /* Offset: 0x08  PWM Control Register                                               */
    __IO uint32_t CNR0;          /* Offset: 0x0C  PWM Counter Register 0                                             */
    __IO uint32_t CMR0;          /* Offset: 0x10  PWM Comparator Register 0                                          */
    __I  uint32_t PDR0;          /* Offset: 0x14  PWM Data Register 0                                                */
    __IO uint32_t CNR1;          /* Offset: 0x18  PWM Counter Register 1                                             */
    __IO uint32_t CMR1;          /* Offset: 0x1C  PWM Comparator Register 1                                          */
    __I  uint32_t PDR1;          /* Offset: 0x20  PWM Data Register 1                                                */
    __IO uint32_t CNR2;          /* Offset: 0x24  PWM Counter Register 2                                             */
    __IO uint32_t CMR2;          /* Offset: 0x28  PWM Comparator Register 2                                          */
    __I  uint32_t PDR2;          /* Offset: 0x2C  PWM Data Register 2                                                */
    __IO uint32_t CNR3;          /* Offset: 0x30  PWM Counter Register 3                                             */
    __IO uint32_t CMR3;          /* Offset: 0x34  PWM Comparator Register 3                                          */
    __I  uint32_t PDR3;          /* Offset: 0x38  PWM Data Register 3                                                */
    __I  uint32_t RESERVED0[1];
    __IO uint32_t PIER;          /* Offset: 0x40  PWM Interrupt Enable Register                                      */
    __IO uint32_t PIIR;          /* Offset: 0x44  PWM Interrupt Indication Register                                  */
    __I  uint32_t RESERVE1[2];
    __IO uint32_t CCR0;          /* Offset: 0x50  PWM Capture Control Register 0                                     */
    __IO uint32_t CCR2;          /* Offset: 0x54  PWM Capture Control Register 2                                     */
    __IO uint32_t CRLR0;         /* Offset: 0x58  PWM Capture Rising Latch Register (Channel 0)                      */
    __IO uint32_t CFLR0;         /* Offset: 0x5C  PWM Capture Falling Latch Register (Channel 0)                     */
    __IO uint32_t CRLR1;         /* Offset: 0x60  PWM Capture Rising Latch Register (Channel 1)                      */
    __IO uint32_t CFLR1;         /* Offset: 0x64  PWM Capture Falling Latch Register (Channel 1)                     */
    __IO uint32_t CRLR2;         /* Offset: 0x68  PWM Capture Rising Latch Register (Channel 2)                      */
    __IO uint32_t CFLR2;         /* Offset: 0x6C  PWM Capture Falling Latch Register (Channel 2)                     */
    __IO uint32_t CRLR3;         /* Offset: 0x70  PWM Capture Rising Latch Register (Channel 3)                      */
    __IO uint32_t CFLR3;         /* Offset: 0x74  PWM Capture Falling Latch Register (Channel 3)                     */
    __IO uint32_t CAPENR;        /* Offset: 0x78  PWM Capture Input 0~3 Enable Register                              */
    __IO uint32_t POE;           /* Offset: 0x7C  PWM Output Enable for Channel 0~3                                  */
    __IO uint32_t TCON;          /* Offset: 0x80  PWM Trigger Control for Channel 0~3                                */
    __IO uint32_t TSTATUS;       /* Offset: 0x84  PWM Trigger Status Register                                        */
    __IO uint32_t SYNCBUSY0;     /* Offset: 0x88  PWM0 Synchronous Busy Status Register                              */
    __IO uint32_t SYNCBUSY1;     /* Offset: 0x8C  PWM1 Synchronous Busy Status Register                              */
    __IO uint32_t SYNCBUSY2;     /* Offset: 0x90  PWM2 Synchronous Busy Status Register                              */
    __IO uint32_t SYNCBUSY3;     /* Offset: 0x94  PWM3 Synchronous Busy Status Register                              */
    __I  uint32_t RESERVE2[10];
    __IO uint32_t CAPPDMACTL;    /* Offset: 0xC0  PWM Group A Trigger Status Register                                */
    __IO uint32_t CAP0PDMA;      /* Offset: 0xC4  PWM Group A PDMA channel 0 DATA Register                           */
    __IO uint32_t CAP1PDMA;      /* Offset: 0xC8  PWM Group A PDMA channel 1 DATA Register                           */
    __IO uint32_t CAP2PDMA;      /* Offset: 0xCC  PWM Group A PDMA channel 2 DATA Register                           */
    __IO uint32_t CAP3PDMA;      /* Offset: 0xD0  PWM Group A PDMA channel 3 DATA Register                           */

} PWM_T;




