MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC123SD4AN0/mcu.h
 * |        |          |(PB5_MFP1 (ALT_MFP[18]), GPB_MFP[5]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART1_TXD function is selected.
 * |        |          |(1, 1) = SPI2_CLK function is selected.
 * |[20]    |PC12_MFP1 |PC.12 Pin Alternate Function Selection
 * |        |          |Bits PC12_MFP1 (ALT_MFP[20]) and GPC_MFP[12] determine the PC.12 function.
 * |        |          |(PC12_MFP1 (ALT_MFP[20]), GPC_MFP[12]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI1_MISO1 function is selected.
 * |        |          |(1, 0) = I2S_MCLK function is selected.
 * |        |          |(1, 1) = PWM2 function is selected.
 * |[21]    |PC13_MFP1 |PC.13 Pin Alternate Function Selection
 * |        |          |Bits PC13_MFP1 (ALT_MFP[21]) and GPC_MFP[13] determine the PC.13 function.
 * |        |          |(PC13_MFP1 (ALT_MFP[21]), GPC_MFP[13]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI1_MOSI1 function is selected.
 * |        |          |(1, 0) = CLKO function is selected.
 * |        |          |(1, 1) = PWM3 function is selected.
 * |[24]    |PB15_MFP1 |PB.15 Pin Alternate Function Selection
 * |        |          |Bits PB15_MFP1 (ALT_MFP[24]) and GPB_MFP[15] determine the PB.15 function.
 * |        |          |(PB15_MFP1 (ALT_MFP[24]), GPB_MFP[15])  value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = INT1 function is selected.
 * |        |          |(1, 1) = TM0_EXT function is selected.
 * |[26]    |PB2_MFP1  |PB.2 Pin Alternate Function Selection
 * |        |          |Bits PB2_MFP1 (ALT_MFP[26]) and GPB_MFP[2] determine the PB.2 function.
 * |        |          |(PB2_MFP1 (ALT_MFP[26]), GPB_MFP[2]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART0_nRTS function is selected.
 * |        |          |(1, 1) = TM2_EXT function is selected.
 * |[27]    |PB3_MFP1  |PB.3 Pin Alternate Function Selection
 * |        |          |Bits PB3_MFP1 (ALT_MFP[27]) and GPB_MFP[3] determine the PB.3 function.
 * |        |          |(PB3_MFP1 (ALT_MFP[27]), GPB_MFP[3]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART0_nCTS function is selected.
 * |        |          |(1, 1) = TM3_EXT function is selected.
 * |[29]    |PC4_MFP1  |PC.4 Pin Alternate Function Selection
 * |        |          |Bits PC4_MFP1 (ALT_MFP[29]) and GPC_MFP[4] determine the PC.4 function.
 * |        |          |(PC4_MFP1 (ALT_MFP[29]), GPC_MFP[4]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MISO1 function is selected.
 * |        |          |(1, 1) = UART0_RXD function is selected.
 * |[30]    |PC5_MFP1  |PC.5 Pin Alternate Function Selection
 * |        |          |Bits PC5_MFP1 (ALT_MFP[30]) and GPC_MFP[5] determine the PC.5 function.
 * |        |          |(PC5_MFP1 (ALT_MFP[30]), GPC_MFP[5]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MOSI1 function is selected.
 * |        |          |(1, 1) = UART0_TXD function is selected.
 * @var GCR_T::ALT_MFP1
 * Offset: 0x54  Alternative Multiple Function Pin Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[16]    |PD0_MFP1  |PD.0 Pin Alternate Function Selection
 * |        |          |Bits PD0_MFP1 (ALT_MFP1[16]) and GPD_MFP[0] determine the PD.0 function.
 * |        |          |(PD0_MFP1 (ALT_MFP1[16]), GPD_MFP[0]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(1, 0) = SPI2_SS0 function is selected.
 * |        |          |(1, 1) = ADC0 function is selected.
 * |[17]    |PD1_MFP1  |PD.1 Pin Alternate Function Selection
 * |        |          |Bits PD1_MFP1 (ALT_MFP1[17]) and GPD_MFP[1] determine the PD.1 function.
 * |        |          |(PD1_MFP1 (ALT_MFP1[17]), GPD_MFP[1]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_SS1 function is selected.
 * |        |          |(1, 0) = SPI2_CLK function is selected.
 * |        |          |(1, 1) = ADC1 function is selected.
 * |[18]    |PD2_MFP1  |PD.2 Pin Alternate Function Selection
 * |        |          |Bits PD2_MFP1 (ALT_MFP1[18]) and GPD_MFP[2] determine the PD.2 function.
 * |        |          |(PD2_MFP1 (ALT_MFP1[18]), GPD_MFP[2]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MISO1 function is selected.
 * |        |          |(1, 0) = SPI2_MISO0 function is selected.
 * |        |          |(1, 1) = ADC2 function is selected.
 * |[19]    |PD3_MFP1  |PD.3 Pin Alternate Function Selection
 * |        |          |Bits PD3_MFP1 (ALT_MFP1[19]) and GPD_MFP[3] determine the PD.3 function.
 * |        |          |(PD3_MPF1 (ALT_MFP1[19]), GPD_MFP[3]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MOSI1 function is selected.
 * |        |          |(1, 0) = SPI2_MOSI0 function is selected.
 * |        |          |(1, 1) = ADC3 function is selected.
 * |[20]    |PD4_MFP1  |PD.4 Pin Alternate Function Selection
 * |        |          |Bits PD4_MFP1 (ALT_MFP1[20]) and GPD_MFP[4] determine the PD.4 function.
 * |        |          |(PD4_MFP1 (ALT_MFP1[20]), GPD_MFP[4]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(1, 0) = SPI2_MISO1 function is selected.
 * |        |          |(1, 1) = ADC4 function is selected.
 * |[21]    |PD5_MFP1  |PD.5 Pin Alternate Function Selection
 * |        |          |Bits PD5_MFP1 (ALT_MFP1[21]) and GPD_MFP[5] determine the PD.5 function.
 * |        |          |(PD5_MFP1 (ALT_MFP1[21]), GPD_MFP[5]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(1, 0) = SPI2_MOSI1 function is selected.
 * |        |          |(1, 1) = ADC5 function is selected.
 * |[23]    |PC8_MFP1  |PC.8 Pin Alternate Function Selection
 * |        |          |Bits PC8_MFP1 (ALT_MFP1[23]) and GPC_MFP[8] determine the PC.8 function.
 * |        |          |(PC8_MFP1 (ALT_MFP1[23]), GPC_MFP[8]) value and function mapping are as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI1_SS0 function is selected.
 * |        |          |(1, 1) = PWM0 function is selected. (NUC123xxxAEx Only)
 * |[25:24] |PF2_MFP1  |PF.2 Pin Alternate Function Selection
 * |        |          |Bits PF2_MFP1 (ALT_MFP1[25:24]) and GPF_MFP[2] determine the PF.2 function.
 * |        |          |(PF2_MFP1(ALT_MFP1 [25:24]), GPF_MFP[2]) value and function mapping are as following list.
 * |        |          |(00, 0) = GPIO function is selected.
 * |        |          |(00, 1) = PS2_DAT function is selected.
 * |        |          |(10, 1) = I2C0_SDA function is selected.
 * |        |          |(11, 1) = ADC6 function is selected.
 * |[27:26] |PF3_MFP1  |PF.3 Pin Alternate Function Selection
 * |        |          |Bits PF3_MFP1 (ALT_MFP1[27:26]) and GPF_MFP[3] determine the PF.3 function.
 * |        |          |(PF3_MFP1 (ALT_MFP1[27:26]), GPF_MFP[3]) value and function mapping are as following list.
 * |        |          |(00, 0) = GPIO function is selected.
 * |        |          |(00, 1) = PS2_CLK function is selected.
 * |        |          |(10, 1) = I2C0_SCL function is selected.
 * |        |          |(11, 1) = ADC7 function is selected.
 * @var GCR_T::GPA_IOCR
 * Offset: 0xC0  GPIOA IO Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[10]    |GPA10_DS  |PA.10 Pin Driving Strength Selection
 * |        |          |0 = PA.10 strong driving strength mode Disabled.
 * |        |          |1 = PA.10 strong driving strength mode Enabled.
 * |[11]    |GPA11_DS  |PA.11 Pin Driving Strength Selection
 * |        |          |0 = PA.11 strong driving strength mode Disabled.
 * |        |          |1 = PA.11 strong driving strength mode Enabled.
 * @var GCR_T::GPB_IOCR
 * Offset: 0xC4  GPIOB IO Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4]     |GPB4_DS   |PB.4 Pin Driving Strength Selection
 * |        |          |0 = PB.4 strong driving strength mode Disabled.
 * |        |          |1 = PB.4 strong driving strength mode Enabled.
 * |[5]     |GPB5_DS   |PB.5 Pin Driving Strength Selection
 * |        |          |0 = PB.5 strong driving strength mode Disabled.
 * |        |          |1 = PB.5 strong driving strength mode Enabled.
 * |[6]     |GPB6_DS   |PB.6 Pin Driving Strength Selection
 * |        |          |0 = PB.6 strong driving strength mode Disabled.
 * |        |          |1 = PB.6 strong driving strength mode Enabled.
 * |[7]     |GPB7_DS   |PB.7 Pin Driving Strength Selection
 * |        |          |0 = PB.7 strong driving strength mode Disabled.
 * |        |          |1 = PB.7 strong driving strength mode Enabled.
 * |[8]     |GPB8_DS   |PB.8 Pin Driving Strength Selection
 * |        |          |0 = PB.8 strong driving strength mode Disabled.
 * |        |          |1 = PB.8 strong driving strength mode Enabled.
 * |[12]    |GPB12_DS  |PB.12 Pin Driving Strength Selection
 * |        |          |0 = PB.12 strong driving strength mode Disabled.
 * |        |          |1 = PB.12 strong driving strength mode Enabled.
 * |[13]    |GPB13_DS  |PB.13 Pin Driving Strength Selection
 * |        |          |0 = PB.13 strong driving strength mode Disabled.
 * |        |          |1 = PB.13 strong driving strength mode Enabled.
 * |[14]    |GPB14_DS  |PB.14 Pin Driving Strength Selection
 * |        |          |0 = PB.14 strong driving strength mode Disabled.
 * |        |          |1 = PB.14 strong driving strength mode Enabled.
 * @var GCR_T::GPD_IOCR
 * Offset: 0xCC  GPIOD IO Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[8]     |GPD8_DS   |PD.8 Pin Driving Strength Selection
 * |        |          |0 = PD.8 strong driving strength mode Disabled.
 * |        |          |1 = PD.8 strong driving strength mode Enabled.
 * |[9]     |GPD9_DS   |PD.9 Pin Driving Strength Selection
 * |        |          |0 = PD.9 strong driving strength mode Disabled.
 * |        |          |1 = PD.9 strong driving strength mode Enabled.
 * |[10]    |GPD10_DS  |PD.10 Pin Driving Strength Selection
 * |        |          |0 = PD.10 strong driving strength mode Disabled.
 * |        |          |1 = PD.10 strong driving strength mode Enabled.
 * |[11]    |GPD11_DS  |PD.11 Pin Driving Strength Selection
 * |        |          |0 = PD.11 strong driving strength mode Disabled.
 * |        |          |1 = PD.11 strong driving strength mode Enabled.
 * @var GCR_T::REGWRPROT
 * Offset: 0x100  Register Write Protect register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |REGPROTDIS|Register Write-Protection Disable index (Read Only)
 * |        |          |1 = Write-protection Disabled for writing protected registers.
 * |        |          |0 = Write-protection Enabled for writing protected registers.
 * |        |          |Any write to the protected register is ignored.
 * |        |          |The Protected registers are:
 * |        |          |IPRSTC1: address 0x5000_0008
 * |        |          |BODCR: address 0x5000_0018
 * |        |          |PORCR: address 0x5000_0024
 * |        |          |PWRCON: address 0x5000_0200 (bit[6] is not protected for power wake-up interrupt clear)
 * |        |          |APBCLK bit[0]: address 0x5000_0208 (bit[0] is watchdog clock enabled)
 * |        |          |CLKSEL0: address 0x5000_0210 (for HCLK and CPU STCLK clock source select)
 * |        |          |CLKSEL1 bit[1:0]: address 0x5000_0214 (for watchdog clock source select)
 * |        |          |ISPCON: address 0x5000_C000 (Flash ISP Control register)
 * |        |          |WTCR: address 0x4000_4000
 * |        |          |FATCON: address 0x5000_C018
 * |[7:0]   |REGWRPROT |Register Write-Protection Code (Write Only)
 * |        |          |Some registers have write-protection function. Writing these registers has to disable the protected function by writing the sequence value "59h", "16h", "88h" to this field.
 * |        |          |After this sequence is completed, the REGPROTDIS bit will be set to 1 and write-protection registers can be normal write.
 * @var GCR_T::GPA_MFPH
 * Offset: 0x134  GPIOA Multiple Function High Byte Control Register (NUC123xxxAEx Only)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[10:8]  |GPA10_MFP |PA.10 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= I2C1_SDA function is selected.
 * |        |          |010	= SPI1_MISO0 function is selected.
 * |        |          |011	= SPI2_MISO0 function is selected.
 * |[14:12] |GPA11_MFP |PA.11 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= I2C1_SCL function is selected.
 * |        |          |010	= SPI1_CLK function is selected.
 * |        |          |011	= SPI2_MOSI0 function is selected.
 * |[18:16] |GPA12_MFP |PA.12 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= PWM0 function is selected.
 * |[22:20] |GPA13_MFP |PA.13 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= PWM1 function is selected.
 * |[26:24] |GPA14_MFP |PA.14 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= PWM2 function is selected.
 * |[30:28] |GPA15_MFP |PA.15 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= PWM3 function is selected.
 * |        |          |010	= CLKO function is selected.
 * |        |          |011	= I2S_MCLK function is selected.
 * @var GCR_T::GPB_MFPL
 * Offset: 0x138  GPIOB Multiple Function Low Byte Control Register (NUC123xxxAEx Only)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |GPB0_MFP  |PB.0 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= UART0_RXD function is selected.
 * |[6:4]   |GPB1_MFP  |PB.1 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= UART0_TXD function is selected.
 * |[10:8]  |GPB2_MFP  |PB.2 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= UART0_nRTS function is selected.
 * |        |          |010	= TM2_EXT function is selected.
 * |[14:12] |GPB3_MFP  |PB.3 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= UART0_nCTS function is selected.
 * |        |          |010	= TM3_EXT function is selected.
 * |[18:16] |GPB4_MFP  |PB.4 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= UART1_RXD function is selected.
 * |        |          |010	= SPI2_SS0 function is selected.
 * |        |          |010	= SPI1_SS1 function is selected.
 * |[22:20] |GPB5_MFP  |PB.5 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= UART1_TXD function is selected.
 * |        |          |010	= SPI2_CLK function is selected.
 * |[26:24] |GPB6_MFP  |PB.6 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= UART1_nRTS function is selected.
 * |        |          |010	= SPI2_MOSI0 function is selected.
 * |[30:28] |GPB7_MFP  |PB.7 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= UART1_nCTS function is selected.
 * |        |          |010	= SPI2_MISO0 function is selected.
 * @var GCR_T::GPB_MFPH
 * Offset: 0x13C  GPIOB Multiple Function High Byte Control Register (NUC123xxxAEx Only)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |GPB8_MFP  |PB.8 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= TM0 function is selected.
 * |[6:4]   |GPB9_MFP  |PB.9 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= TM1 function is selected.
 * |        |          |010	= SPI1_SS1 function is selected.
 * |        |          |011	= PWM1 function is selected.
 * |[10:8]  |GPB10_MFP |PB.10 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= TM2 function is selected.
 * |        |          |010	= SPI0_SS1 function is selected.
 * |[18:16] |GPB12_MFP |PB.12 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI1_SS0 function is selected.
 * |        |          |010	= CLKO function is selected.
 * |[22:20] |GPB13_MFP |PB.13 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |[26:24] |GPB14_MFP |PB.14 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= INT0 function is selected.
 * |[30:28] |GPB15_MFP |PB.15 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= INT1 function is selected.
 * |        |          |010	= TM0_EXT function is selected.
 * @var GCR_T::GPC_MFPL
 * Offset: 0x140  GPIOC Multiple Function Low Byte Control Register (NUC123xxxAEx Only)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |GPC0_MFP  |PC.0 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI0_SS0 function is selected.
 * |        |          |010	= I2S_LRCK function is selected.
 * |[6:4]   |GPC1_MFP  |PC.1 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI0_CLK function is selected.
 * |        |          |001	= I2S_BCLK function is selected.
 * |[10:8]  |GPC2_MFP  |PC.2 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI0_MISO0 function is selected.
 * |        |          |010	= I2S_DI function is selected.
 * |[14:12] |GPC3_MFP  |PC.3 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI0_MIOSI0 function is selected.
 * |        |          |010	= I2S_DO function is selected.
 * |[18:16] |GPC4_MFP  |PC.4 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI0_MISO1 function is selected.
 * |        |          |010	= UART0_RXD function is selected.
 * |[22:20] |GPC5_MFP  |PC.5 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI0_MOSI1 function is selected.
 * |        |          |010	= UART0_TXD function is selected.
 * @var GCR_T::GPC_MFPH
 * Offset: 0x144  GPIOC Multiple Function High Byte Control Register (NUC123xxxAEx Only)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |GPC8_MFP  |PC.8 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI1_SS0 function is selected.
 * |        |          |010	= PWM0 function is selected.
 * |[6:4]   |GPC9_MFP  |PC.9 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI1_CLK function is selected.
 * |[10:8]  |GPC10_MFP |PC.10 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI1_MISO0 function is selected.
 * |[14:12] |GPC11_MFP |PC.11 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI1_MOSI0 function is selected.
 * |[18:16] |GPC12_MFP |PC.12 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI1_MISO1 function is selected.
 * |        |          |010	= I2S_MCLK function is selected.
 * |        |          |011	= PWM2 function is selected.
 * |[22:20] |GPC13_MFP |PC.13 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI1_MOSI1 function is selected.
 * |        |          |010	= CLKO function is selected.
 * |        |          |011	= PWM3 function is selected.
 * @var GCR_T::GPD_MFPL
 * Offset: 0x148  GPIOD Multiple Function Low Byte Control Register (NUC123xxxAEx Only)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |GPD0_MFP  |PD.0 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI2_SS0 function is selected.
 * |        |          |010	= ADC0 function is selected.
 * |[6:4]   |GPD1_MFP  |PD.1 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI0_SS1 function is selected.
 * |        |          |010	= SPI2_CLK function is selected.
 * |        |          |011	= ADC1 function is selected.
 * |[10:8]  |GPD2_MFP  |PD.2 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI0_MISO1 function is selected.
 * |        |          |010	= SPI2_MISO0 function is selected.
 * |        |          |010	= ADC2 function is selected.
 * |[14:12] |GPD3_MFP  |PD.3 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI0_MOSI1 function is selected.
 * |        |          |010	= SPI2_MOSI0 function is selected.
 * |        |          |011	= ADC3 function is selected.
 * |[18:16] |GPD4_MFP  |PD.4 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
