MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC123SD4AN0/mcu.h
 * |        |          |001	= SPI2_MISO1 function is selected.
 * |        |          |010	= ADC4 function is selected.
 * |[22:20] |GPD5_MFP  |PD.5 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI2_MOSI1 function is selected.
 * |        |          |010	= ADC5 function is selected.
 * @var GCR_T::GPD_MFPH
 * Offset: 0x14C  GPIOD Multiple Function High Byte Control Register (NUC123xxxAEx Only)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |GPD8_MFP  |PD.8 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= SPI1_MOSI0 function is selected.
 * |[6:4]   |GPD9_MFP  |PD.9 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |[10:8]  |GPD10_MFP |PD.10 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= CLKO function is selected.
 * |[14:12] |GPD11_MFP |PD.11 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= INT1 function is selected.
 * @var GCR_T::GPF_MFPL
 * Offset: 0x158  GPIOF Multiple Function Low Byte Control Register (NUC123xxxAEx Only)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |GPF0_MFP  |PF.0 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= XT1_OUT function is selected.
 * |[6:4]   |GPF1_MFP  |PF.1 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= XT1_IN function is selected.
 * |[10:8]  |GPF2_MFP  |PF.2 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= PS2_DAT function is selected.
 * |        |          |010	= I2C0_SDA function is selected.
 * |        |          |010	= ADC6 function is selected.
 * |[14:12] |GPF3_MFP  |PF.3 Pin Function Selection
 * |        |          |000	= GPIO function is selected.
 * |        |          |001	= PS2_CLK function is selected.
 * |        |          |010	= I2C0_SCL function is selected.
 * |        |          |011	= ADC7 function is selected.
 */

    __I  uint32_t PDID;          /* Offset: 0x00  Part Device Identification Number Register                         */
    __IO uint32_t RSTSRC;        /* Offset: 0x04  System Reset Source Register                                       */
    __IO uint32_t IPRSTC1;       /* Offset: 0x08  Peripheral Reset Control Register 1                                */
    __IO uint32_t IPRSTC2;       /* Offset: 0x0C  Peripheral Reset Control Register 2                                        */
    __I  uint32_t RESERVE0[2];
    __IO uint32_t BODCR;         /* Offset: 0x18  Brown-out Detector Control Register                                */
    __I  uint32_t RESERVE1[2];
    __IO uint32_t PORCR;         /* Offset: 0x24  Power-on-Reset Controller Register                                 */
    __I  uint32_t RESERVE2[2];
    __IO uint32_t GPA_MFP;       /* Offset: 0x30  GPIOA Multiple Function and Input Type Control Register            */
    __IO uint32_t GPB_MFP;       /* Offset: 0x34  GPIOB Multiple Function and Input Type Control Register            */
    __IO uint32_t GPC_MFP;       /* Offset: 0x38  GPIOC Multiple Function and Input Type Control Register            */
    __IO uint32_t GPD_MFP;       /* Offset: 0x3C  GPIOD Multiple Function and Input Type Control Register            */
    __I  uint32_t RESERVE3;
    __IO uint32_t GPF_MFP;       /* Offset: 0x44  GPIOF Multiple Function and Input Type Control Register            */
    __I  uint32_t RESERVE4[2];
    __IO uint32_t ALT_MFP;       /* Offset: 0x50  Alternative Multiple Function Pin Control Register                 */
    __IO uint32_t ALT_MFP1;      /* Offset: 0x54  Alternative Multiple Function Pin Control Register 1               */
    __I  uint32_t RESERVE5[26];
    __IO uint32_t GPA_IOCR;      /* Offset: 0xC0  GPIOA IO Control Register                                          */
    __IO uint32_t GPB_IOCR;      /* Offset: 0xC4  GPIOB IO Control Register                                          */
    __I  uint32_t RESERVE6;
    __IO uint32_t GPD_IOCR;      /* Offset: 0xCC  GPIOD IO Control Register                                          */
    __I  uint32_t RESERVE7[12];
    __IO uint32_t REGWRPROT;     /* Offset: 0x100  Register Write Protect register                                   */
    __I  uint32_t RESERVE8[12];
    __IO uint32_t GPA_MFPH;      /* Offset: 0x134  GPIOA Multiple Function High Byte Control Register (NUC123xxxAEx Only) */
    __IO uint32_t GPB_MFPL;      /* Offset: 0x138  GPIOB Multiple Function Low Byte Control Register (NUC123xxxAEx Only) */
    __IO uint32_t GPB_MFPH;      /* Offset: 0x13C  GPIOB Multiple Function High Byte Control Register (NUC123xxxAEx Only) */
    __IO uint32_t GPC_MFPL;      /* Offset: 0x140  GPIOC Multiple Function Low Byte Control Register (NUC123xxxAEx Only) */
    __IO uint32_t GPC_MFPH;      /* Offset: 0x144  GPIOC Multiple Function High Byte Control Register (NUC123xxxAEx Only) */
    __IO uint32_t GPD_MFPL;      /* Offset: 0x148  GPIOD Multiple Function Low Byte Control Register (NUC123xxxAEx Only) */
    __IO uint32_t GPD_MFPH;      /* Offset: 0x14C  GPIOD Multiple Function High Byte Control Register (NUC123xxxAEx Only) */
    __I  uint32_t RESERVE9[2];
    __IO uint32_t GPF_MFPL;      /* Offset: 0x158  GPIOF Multiple Function Low Byte Control Register (NUC123xxxAEx Only) */

} GCR_T;




/** @addtogroup REG_SYS_BITMASK SYS Bit Mask
  @{
 */

/* GCR RSTSRC Bit Field Definitions */
#define SYS_RSTSRC_RSTS_CPU_Pos                 7                                   /*!< GCR_T::RSTSRC: RSTS_CPU Position */
#define SYS_RSTSRC_RSTS_CPU_Msk                 (1ul << SYS_RSTSRC_RSTS_CPU_Pos)    /*!< GCR_T::RSTSRC: RSTS_CPU Mask */

#define SYS_RSTSRC_RSTS_SYS_Pos                 5                                   /*!< GCR_T::RSTSRC: RSTS_SYS Position */
#define SYS_RSTSRC_RSTS_SYS_Msk                 (1ul << SYS_RSTSRC_RSTS_SYS_Pos)    /*!< GCR_T::RSTSRC: RSTS_SYS Mask */

#define SYS_RSTSRC_RSTS_BOD_Pos                 4                                   /*!< GCR_T::RSTSRC: RSTS_BOD Position */
#define SYS_RSTSRC_RSTS_BOD_Msk                 (1ul << SYS_RSTSRC_RSTS_BOD_Pos)    /*!< GCR_T::RSTSRC: RSTS_BOD Mask */

#define SYS_RSTSRC_RSTS_LVR_Pos                 3                                   /*!< GCR_T::RSTSRC: RSTS_LVR Position */
#define SYS_RSTSRC_RSTS_LVR_Msk                 (1ul << SYS_RSTSRC_RSTS_LVR_Pos)    /*!< GCR_T::RSTSRC: RSTS_LVR Mask */

#define SYS_RSTSRC_RSTS_WDT_Pos                 2                                   /*!< GCR_T::RSTSRC: RSTS_WDT Position */
#define SYS_RSTSRC_RSTS_WDT_Msk                 (1ul << SYS_RSTSRC_RSTS_WDT_Pos)    /*!< GCR_T::RSTSRC: RSTS_WDT Mask */

#define SYS_RSTSRC_RSTS_RESET_Pos               1                                   /*!< GCR_T::RSTSRC: RSTS_RESET Position */
#define SYS_RSTSRC_RSTS_RESET_Msk               (1ul << SYS_RSTSRC_RSTS_RESET_Pos)  /*!< GCR_T::RSTSRC: RSTS_RESET Mask */

#define SYS_RSTSRC_RSTS_POR_Pos                 0                                   /*!< GCR_T::RSTSRC: RSTS_POR Position */
#define SYS_RSTSRC_RSTS_POR_Msk                 (1ul << SYS_RSTSRC_RSTS_POR_Pos)    /*!< GCR_T::RSTSRC: RSTS_POR Mask */

